app/controllers/posts_controller.rb

    def index
        #@post = Post.all
        @posts = Post.all
---
SELECT "posts".* FROM "posts"

    def update
        @post = Post.find(params[:id])

        if(@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Curiosity killed the cat, but satisfaction brought it back. Which is whack!"], ["updated_at", "2018-11-27 03:52:10.646575"], ["id", 1]]